# ScheduleDefinition Properties (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
ScheduleDefinition Properties
ScheduleDefinition Class See Also
---
The ScheduleDefinition type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AreaSchemeId | In an area schedule, the ID of the area scheme to display. |
| CategoryId | The category ID of elements appearing in the schedule. |
| EmbeddedDefinition | The embedded ScheduleDefinition. |
| FamilyId | In a note block schedule, the ID of the Generic Annotation family displayed by the schedule. |
| GrandTotalTitle | The title name is used to display at the grand total row. The name is "Grand total", expressed in the Revit session language, by default. |
| HasEmbeddedSchedule | Indicates if this ScheduleDefinition has an embedded ScheduleDefinition. |
| IncludeLinkedFiles | Indicates if the schedule includes elements from linked files. |
| IsEmbedded | Indicates if this is an embedded ScheduleDefinition. |
| IsItemized | Indicates if the schedule displays each element on a separate row or combines multiple grouped elements onto the same row. |
| IsKeySchedule | Indicates if the schedule is a key schedule. |
| IsMaterialTakeoff | Indicates if the schedule is a material takeoff. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ShowGrandTotal | Indicates if a grand total row should be displayed at the bottom of the schedule. |
| ShowGrandTotalCount | Indicates if the grand total row should display a count of elements in the schedule. |
| ShowGrandTotalTitle | Indicates if the grand total row should display a title. |
| ShowGridLines | Indicates if the schedule grid lines will be visible on a sheet. |
| ShowHeaders | Indicates if the headers will be displayed in the schedule. |
| ShowTitle | Indicates if the title will be displayed in the schedule. |

# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace